<?php

		function GetFaction($faction_res_id){
			$Faction = Array(
				'Лига'		=> Array('41238'),
				'Империя'		=> Array('41240')

			);
			
			return SearchArray($Faction, $faction_res_id);
			
		}
			
		function GetClass($race_class_res_id){
			$Class = Array(
			'Бард'		=> Array('274401281'),
			'Воин'		=> Array('61117'),
			'Волшебник'		=> Array('64104'),
			'Демонолог'		=> Array('740021330'),
			'Жрец'		=> Array('61119'),
			'Инженер'		=> Array('739833443'),
			'Мистик'		=> Array('64105'),
			'Некромант'		=> Array('61121'),
			'Разведчик'		=> Array('61123'),
			'Храмовник'		=> Array('61120'),
			'Язычник'		=> Array('64103'),
			'Солдат'		=> Array('411435099'),
			'Вояки'		=> Array('411435089'),
			'Боец'		=> Array('411435014'),
			'Ратник'		=> Array('411435013'),
			'Витязь'		=> Array('411435057'),
			'Каратель'		=> Array('411435056'),
			'Комиссар'		=> Array('411435030'),
			'Паладин'		=> Array('411435018'),
			'Чародей'		=> Array('411435110'),
			'Заклинатель'		=> Array('411435016'),
			'Специалист'		=> Array('237546511'),
			'Оракул'		=> Array('237546519'),
			'Провидцы'		=> Array('411435040'),
			'Магистр'		=> Array('411435047'),
			'Адепт'		=> Array('411435050'),
			'Мыслитель'		=> Array('411435067'),
			'Агитатор'		=> Array('274401304'),
			'Менестрель'		=> Array('274401320'),
			'Гастролёр'		=> Array('274401331'),
			'Скальд'		=> Array('274401332'),
			'Настоятель'		=> Array('411435011'),
			'Политрук'		=> Array('411435028'),
			'Капеллан'		=> Array('411435043'),
			'Священник'		=> Array('411435053'),
			'Реаниматор'		=> Array('411435021'),
			'Чернокнижник'		=> Array('411435008'),
			'Целитель'		=> Array('411435032'),
			'Проныры'		=> Array('411435042'),
			'Диверсант'		=> Array('411435051'),
			'Лучник'		=> Array('411435087'),
			'Головорез'		=> Array('411435088'),
			'Шаман'		=> Array('411435054'),
			'Друид'		=> Array('411435055'),
			'Знахари'		=> Array('411435071'),
			'Ангел '		=> Array('411435041'),
			);
			
			return SearchArray($Class, $race_class_res_id);
			
		}




	function  GetRace($race_class_res_id){
		$Races = Array(
			'Хадаган'	=> Array('237546511', '274401304', '411435021', '411435028', '411435030', '411435050', '411435051', '411435099'),
			'Кания'		=> Array('274401332', '411435013', '411435041', '411435053', '411435055', '411435057', '411435087', '411435110'),
			'Эльфы'			=> Array('237546519', '274401320', '411435018', '411435008', '411435043', '411435047'),
			'Орки'			=> Array('274401331', '411435014', '411435054', '411435056', '411435088'),
			'Восставшие'		=> Array('411435011', '411435016', '411435032', '411435067'),
			'Гибберлинги'	=> Array('411435040', '411435042', '411435071', '411435089')
		);
		
	return SearchArray($Races, $race_class_res_id);
		
	}
		function SearchArray($Array, $Search) {
			foreach($Array as $index => $Value) {
			  foreach($Value as $A) {
				if($A == $Search) return $index;
			  }
			}
			return false;
		}


?>